In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import datetime

In [2]:
data = pd.read_csv('Meteorite_Landings.csv')
print("Input Data and Shape")
print(data.shape)
data.head()

Input Data and Shape
(45716, 10)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [3]:
data.isnull().sum()

name              0
id                0
nametype          0
recclass          0
mass (g)        131
fall              0
year            291
reclat         7315
reclong        7315
GeoLocation    7315
dtype: int64

In [19]:
data = data.drop('year', axis=1)

In [20]:
data = data.drop('GeoLocation', axis=1)

In [6]:
data.describe()

                 id      mass (g)        reclat       reclong
count  45716.000000  4.558500e+04  38401.000000  38401.000000
mean   26889.735104  1.327808e+04    -39.122580     61.074319
std    16860.683030  5.749889e+05     46.378511     80.647298
min        1.000000  0.000000e+00    -87.366670   -165.433330
25%    12688.750000  7.200000e+00    -76.714240      0.000000
50%    24261.500000  3.260000e+01    -71.500000     35.666670
75%    40656.750000  2.026000e+02      0.000000    157.166670
max    57458.000000  6.000000e+07     81.166670    354.473330

In [12]:
mass = data['mass (g)'].replace(np.NaN,1.32780)

In [13]:
mass.head()

0        21.0
1       720.0
2    107000.0
3      1914.0
4       780.0
Name: mass (g), dtype: float64

In [14]:
print(mass.shape)

(45716,)

In [8]:
data.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [15]:
reclat = data['reclat'].replace(np.NaN, -39.122580)

In [16]:
reclong = data['reclong'].replace(np.NaN, 61.074319)

In [21]:
data = data.drop('mass (g)', axis=1)
data = data.drop('reclat', axis=1)
data = data.drop('reclong', axis=1)

In [22]:
data.head()

       name   id nametype     recclass  fall
0    Aachen    1    Valid           L5  Fell
1    Aarhus    2    Valid           H6  Fell
2      Abee    6    Valid          EH4  Fell
3  Acapulco   10    Valid  Acapulcoite  Fell
4   Achiras  370    Valid           L6  Fell

In [23]:
data.insert(2, "mass", mass, True)

In [25]:
data.insert(2, "reclat", reclat, True)

In [26]:
data.insert(2, "reclong", reclong, True)

In [27]:
data.head()

       name   id    reclong    reclat      mass nametype     recclass  fall
0    Aachen    1    6.08333  50.77500      21.0    Valid           L5  Fell
1    Aarhus    2   10.23333  56.18333     720.0    Valid           H6  Fell
2      Abee    6 -113.00000  54.21667  107000.0    Valid          EH4  Fell
3  Acapulco   10  -99.90000  16.88333    1914.0    Valid  Acapulcoite  Fell
4   Achiras  370  -64.95000 -33.16667     780.0    Valid           L6  Fell

In [28]:
data.isnull().sum()

name        0
id          0
reclong     0
reclat      0
mass        0
nametype    0
recclass    0
fall        0
dtype: int64